rpc/test_data/transfer_complete_fault_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1">123</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
        <cwmp:TransferComplete>
            <CommandKey>upgrade</CommandKey>
            <FaultStruct>
                <FaultCode>9015</FaultCode>
                <FaultString>Server Not Found</FaultString>
            </FaultStruct>
            <StartTime>2024-06-10T23:04:00Z</StartTime>
            <CompleteTime>2024-06-10T23:05:00Z</CompleteTime>
        </cwmp:TransferComplete>
    </soapenv:Body>
</soapenv:Envelope>
